brew "argocd"
brew "aria2"
brew "bat"
brew "cloudflared"
brew "cmake"
brew "ripgrep"
brew "curl"
brew "php"
brew "composer"
brew "coreutils"
brew "dive"
brew "ffmpeg"
brew "fzf"
brew "gdu"
brew "gh"
brew "git"
brew "git-delta"
brew "glab"
brew "hcloud"
brew "helm"
brew "htop"
brew "hyperfine"
brew "imagemagick"
brew "iperf3"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "kube-ps1"
brew "kubeconform"
brew "kubectx"
brew "kubeseal"
brew "kustomize"
brew "lazygit"
brew "mago"
brew "minikube"
brew "mkcert"
brew "mycli"
brew "mydumper"
brew "mysqltuner"
brew "ncdu"
brew "neovim"
brew "nmap"
brew "node"
brew "nss"
brew "octave"
brew "openjdk"
brew "opentofu"
brew "pgloader"
brew "phive"
brew "pnpm"
brew "pv"
brew "rclone"
brew "rust"
brew "starship"
brew "telnet"
brew "tmux"
brew "tree"
brew "velero"
brew "watch"
brew "wget"
brew "xq"
brew "yq"
brew "yt-dlp"
brew "zsh"
brew "zsh-completions"
brew "derailed/k9s/k9s"
brew "fluxcd/tap/flux"
brew "getsentry/tools/sentry-cli"
brew "getsentry/tools/sentry-wizard"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "siderolabs/tap/talosctl"
brew "sst/tap/opencode"
brew "thecasualcoder/stable/kube-fzf"

cask "docker-desktop"
cask "font-hack-nerd-font"
cask "font-sf-pro"
cask "google-chrome"
cask "gpg-suite"
cask "headlamp"
cask "logi-options+"
cask "navicat-for-mysql"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "rapidapi"
cask "rectangle"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "zoom"

vscode "activitywatch.aw-watcher-vscode"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "bmewburn.vscode-intelephense-client"
vscode "databricks.neon-local-connect"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "k--kato.intellij-idea-keybindings"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "msjsdiag.vscode-react-native"
vscode "octref.vetur"
vscode "quicktype.quicktype"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "selfrefactor.niketa-theme"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "wakatime.vscode-wakatime"

go "github.com/spf13/cobra-cli"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/gopls"
go "example/hello"
go "honnef.co/go/tools/cmd/staticcheck"

cargo "create-tauri-app"
cargo "tauri-cli"
